import streamlit as st
import pandas as pd

data = [
    {"商品名": "NA-LX129CL/R", "価格": 348480, "形状": "ドラム式", "人数": "4～5人用"},
    {"商品名": "NA-LX127CL/R", "価格": 298980, "形状": "ドラム式", "人数": "4～5人用"},
    {"商品名": "NA-LX125CL-W", "価格": 268290, "形状": "ドラム式", "人数": "4～5人用"},
    {"商品名": "NA-LX113CL",   "価格": 228690, "形状": "ドラム式", "人数": "4～5人用"},
    {"商品名": "NA-VG2800L/R", "価格": 221464, "形状": "ドラム式", "人数": "2～3人用"},
    {"商品名": "NA-VG780L/R",  "価格": 188888, "形状": "ドラム式", "人数": "2～3人用"},
    {"商品名": "NA-FW10K2",    "価格": 165276, "形状": "縦型", "人数": "4～5人用"},
    {"商品名": "NA-FA12V2",    "価格": 146500, "形状": "縦型", "人数": "4～5人用"},
    {"商品名": "NA-FA11K2",    "価格": 124799, "形状": "縦型", "人数": "4～5人用"},
    {"商品名": "NA-FA10K2",    "価格": 97460,  "形状": "縦型", "人数": "4～5人用"},
    {"商品名": "NA-FA9K2",     "価格": 106145, "形状": "縦型", "人数": "2～3人用"},
    {"商品名": "NA-FA8K2",     "価格": 86333,  "形状": "縦型", "人数": "2～3人用"},
    {"商品名": "NA-FA8H2",     "価格": 74800,  "形状": "縦型", "人数": "2～3人用"},
    {"商品名": "NA-FA7H2",     "価格": 67036,  "形状": "縦型", "人数": "2～3人用"},
    {"商品名": "NA-JFA8K2",    "価格": 139000, "形状": "縦型", "人数": "2～3人用"}
]

# データフレームを作成
df = pd.DataFrame(data)

st.title('Demo: Streamlit')
#https://panasonic.jp/wash/comparison.html
#ヒアリングの要件を作る

laundry=st.radio('洗濯機の種類', ('ドラム式', '縦型','気にしない'),horizontal=True)
people=st.radio('人数', ('1人', '2~3人','4人以上'),horizontal=True)
size=st.radio('洗濯機のスペース', ('狭い', '普通', '広い','分からない'),horizontal=True)
budget=st.radio('予算', ('5万円〜10万円', '10万円〜15万円', '15万円〜20万円', '20万円～25万円','25万円～30万円','30万円以上'),horizontal=True)

if people=='1人':
    people='2～3人用'
elif people=='2~3人':
    people='2～3人用'
elif people=='4人以上':
    people='4～5人用'

if budget=='5万円〜10万円':
    budget=50000
elif budget=='10万円〜15万円':
    budget=100000
elif budget=='15万円〜20万円':
    budget=150000
elif budget=='20万円～25万円':
    budget=200000
elif budget=='25万円～30万円':
    budget=250000
elif budget=='30万円以上':
    budget=300000


if st.button("検索"):
    filtered_data = df[(df['形状'] == laundry) & (df['価格'] >= budget) & (df['価格'] <= budget+50000) & (df['人数'] == people)]
    st.table(filtered_data)





#結果を表示する20個くらいの中から？